#+TITLE: Functions and Interfaces
#+STARTUP: overview hideblocks indent entitiespretty:
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:python :session *Python* :results output :exports both :python python3

** Solution

#+name: decade_enc
#+begin_src python :results output
  def decade():
      our_father()
      for i in range(10):
          hail_mary()
      glory_be()
      fatima()

  decade()
#+end_src

#+RESULTS: decade_enc
: Our Father, who art in heaven...
: Hail Mary, full of grace...
: Hail Mary, full of grace...
: Hail Mary, full of grace...
: Hail Mary, full of grace...
: Hail Mary, full of grace...
: Hail Mary, full of grace...
: Hail Mary, full of grace...
: Hail Mary, full of grace...
: Hail Mary, full of grace...
: Hail Mary, full of grace...
: Glory be to the Father...
: O my Jesus, forgive us our sins...

** Solution

#+name: decade_gen
#+begin_src python :results output
  def decade(n=10):
      our_father()
      for i in range(n):
          hail_mary()
      glory_be()
      fatima()

  def main():
      decade(n=1)

  if __name__ == "__main__":
      main()
#+end_src

#+RESULTS: decade_gen
: Our Father, who art in heaven...
: Hail Mary, full of grace...
: Glory be to the Father...
: O my Jesus, forgive us our sins...

** Solution

#+name: decade_mystery
#+begin_src python :results output
  def decade(mystery, n=10):
      print(mystery)
      our_father()
      for i in range(n):
          hail_mary()
      glory_be()
      fatima()

  def main():
      decade("The First Sorrowful Mystery: The Agony in the Garden", n=1)

  if __name__ == "__main__":
      main()
#+end_src

#+RESULTS: decade_mystery
: The First Sorrowful Mystery: The Agony in the Garden
: Our Father, who art in heaven...
: Hail Mary, full of grace...
: Glory be to the Father...
: O my Jesus, forgive us our sins...

** Solution

#+name: rosary_sorrowful
#+begin_src python :results output
  sorrowful = [
      "The First Sorrowful Mystery: The Agony in the Garden",
      "The Second Sorrowful Mystery: The Scourging at the Pillar",
      "The Third Sorrowful Mystery: The Crowning with Thorns",
      "The Fourth Sorrowful Mystery: The Carrying of the Cross",
      "The Fifth Sorrowful Mystery: The Crucifixion and Death of Jesus",
  ]

  def rosary(mysteries):
      for mystery in mysteries:
          decade(mystery, n=1)

  def main():
      rosary(sorrowful)

  if __name__ == "__main__":
      main()
#+end_src

#+RESULTS: rosary_sorrowful
#+begin_example
The First Sorrowful Mystery: The Agony in the Garden
Our Father, who art in heaven...
Hail Mary, full of grace...
Glory be to the Father...
O my Jesus, forgive us our sins...
The Second Sorrowful Mystery: The Scourging at the Pillar
Our Father, who art in heaven...
Hail Mary, full of grace...
Glory be to the Father...
O my Jesus, forgive us our sins...
The Third Sorrowful Mystery: The Crowning with Thorns
Our Father, who art in heaven...
Hail Mary, full of grace...
Glory be to the Father...
O my Jesus, forgive us our sins...
The Fourth Sorrowful Mystery: The Carrying of the Cross
Our Father, who art in heaven...
Hail Mary, full of grace...
Glory be to the Father...
O my Jesus, forgive us our sins...
The Fifth Sorrowful Mystery: The Crucifixion and Death of Jesus
Our Father, who art in heaven...
Hail Mary, full of grace...
Glory be to the Father...
O my Jesus, forgive us our sins...
#+end_example

